[
  "table-editor-obsidian",
  "chinese-calendar",
  "obsidian-excalidraw-plugin",
  "obsidian-outliner",
  "obsidian-icon-folder",
  "obsidian-git",
  "quickadd",
  "drawio-obsidian",
  "obsidian-minimal-settings",
  "omnisearch",
  "obsidian-advanced-slides",
  "editing-toolbar",
  "diagram-zoom-drag",
  "customjs"
]